Repository: devenweb/mcbjuicepaypro
Catalog: languages/*.po
Languages: fr_fr

source: Settings
fr_fr: Paramètres

source: MCB Juice QR Payment Premium
fr_fr: Paiement par QR Code MCB Juice Premium

source: Premium payment gateway for MCB Juice QR with advanced features using CDNs.
fr_fr: Passerelle de paiement premium pour MCB Juice QR avec des fonctionnalités avancées utilisant des CDN.

source: Enable/Disable
fr_fr: Activer/Désactiver

source: Enable MCB Juice QR Payment Premium
fr_fr: Activer le paiement par QR Code MCB Juice Premium

source: Title
fr_fr: Titre

source: MCB Juice QR Payment
fr_fr: Paiement par QR Code MCB Juice

source: Pay securely via MCB Juice QR.
fr_fr: Payez en toute sécurité avec MCB Juice QR.

source: QR Code Type
fr_fr: Type de QR Code

source: Static
fr_fr: Statique

source: Dynamic
fr_fr: Dynamique

source: Static QR Code Image URL
fr_fr: URL de l'image du QR Code statique

source: Select a QR code image from the media library.
fr_fr: Sélectionnez une image de QR Code depuis la médiathèque.

source: Bank Logo URL
fr_fr: URL du logo de la banque

source: Select a bank logo from the media library (recommended size: 50x50px).
fr_fr: Sélectionnez un logo de banque depuis la médiathèque (taille recommandée : 50x50px).

source: Enable API Verification
fr_fr: Activer la vérification par API

source: Enable real-time payment verification via API.
fr_fr: Activer la vérification des paiements en temps réel par API.

source: API URL
fr_fr: URL de l'API

source: Enter the API URL for automated verification.
fr_fr: Entrez l'URL de l'API pour la vérification automatisée.

source: API Key
fr_fr: Clé d'API

source: Enter the API Key for automated verification.
fr_fr: Entrez la clé d'API pour la vérification automatisée.

source: API URL and API Key are required for API verification.
fr_fr: L'URL de l'API et la clé d'API sont requises pour la vérification par API.

source: Awaiting QR payment confirmation.
fr_fr: En attente de la confirmation du paiement par QR Code.

source: Payment successfully verified via API.
fr_fr: Paiement vérifié avec succès via l'API.

source: API Verification Failed: %s (Status code: %d)
fr_fr: La vérification par API a échoué : %s (Code d'état : %d)

source: Scan to Pay
fr_fr: Scannez pour payer

source: Please place your order to generate a QR code.
fr_fr: Veuillez passer votre commande pour générer un QR code.
